Revit 2024 API
KeynoteEntries Class
 A collection of KeynoteEntry objects that make up the keynote table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class KeynoteEntries : KeyBasedTreeEntries
Visual Basic
Public Class KeynoteEntries _
	Inherits KeyBasedTreeEntries
Visual C++
public ref class KeynoteEntries : public KeyBasedTreeEntries
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.KeyBasedTreeEntries
 Autodesk.Revit.DB.KeynoteEntries
See Also
KeynoteEntries Members
Autodesk.Revit.DB Namespace